IDENTIFICATION DIVISION.
PROGRAM-ID.  BUSCA.
AUTHOR.  VLADWOGUER BEZERRA.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-ARRAY.
	05 WS-A PIC 9(10) OCCURS 5 TIMES. 

01 AS-CONT PIC 9(10).

PROCEDURE DIVISION.
Begin.
     PERFORM VARYING AS-CONT FROM 0 BY 1 UNTIL AS-CONT=5
	MOVE AS-CONT TO WS-A(AS-CONT)
     END-PERFORM.

     PERFORM VARYING AS-CONT FROM 0 BY 1 UNTIL AS-CONT=5
	DISPLAY WS-A(AS-CONT)
     END-PERFORM.

     PERFORM VARYING AS-CONT FROM 0 BY 1 UNTIL AS-CONT=5
	IF WS-A(AS-CONT)=3 THEN
            DISPLAY "3 Encontrado"
        END-IF
     END-PERFORM.


    STOP RUN.
