IDENTIFICATION DIVISION.
PROGRAM-ID.  CONDICIONAL.
AUTHOR.  VLADWOGUER BEZERRA.

DATA DIVISION.
WORKING-STORAGE SECTION.

01   AS-X       PIC 9(32).


PROCEDURE DIVISION.
Begin.
    MOVE 1 TO AS-X
    EVALUATE AS-X
         WHEN 1 DISPLAY "1"
	 WHEN 2 DISPLAY "2"
         WHEN OTHER DISPLAY "Outro"
    END-EVALUATE.

    STOP RUN.
