       IDENTIFICATION DIVISION.
       PROGRAM-ID. OLA-MUNDO.
      *> Exemplo COBOL Vladwoguer Bezerra Nov-2017
       PROCEDURE DIVISION.
	   DISPLAY 'OLÁ MUNDO!'.
	   STOP RUN.
