IDENTIFICATION DIVISION.
PROGRAM-ID.  OPERADORES.
AUTHOR.  VLADWOGUER BEZERRA.

DATA DIVISION.
WORKING-STORAGE SECTION.

01   AS-X       PIC 9(32).
01   AS-Y       PIC 9(32).
01   AS-Z       PIC 9(32).  
01   AS-F       PIC 9(32)V9(4).
01   AS-R       PIC 9(32).
PROCEDURE DIVISION.
Begin.
    COMPUTE AS-X=90.
    COMPUTE AS-Y=89.
    DISPLAY "X=",AS-X.
    DISPLAY "Y=",AS-Y.
    COMPUTE AS-Z=AS-X + AS-Y.
    DISPLAY "A+B=", AS-Z
    COMPUTE AS-Z=AS-X - AS-Y.
    DISPLAY "A-B=", AS-Z
    COMPUTE AS-Z=AS-X / AS-Y.
    DISPLAY "Inteiro A/B=", AS-Z    
    COMPUTE AS-F=AS-X / AS-Y.
    DISPLAY "Decimal A/B=", AS-F    
    COMPUTE AS-Z=AS-X * AS-Y.
    DISPLAY "A*B=", AS-Z
    DIVIDE AS-X BY AS-Y GIVING AS-Z REMAINDER AS-R.
    DISPLAY "A RESTO B=", AS-R.

    STOP RUN.
