IDENTIFICATION DIVISION.
PROGRAM-ID.  REPETICAO.
AUTHOR.  VLADWOGUER BEZERRA.

DATA DIVISION.
WORKING-STORAGE SECTION.

01   AS-CONT       PIC 9(32).
01   AS-X       PIC 9(32).

PROCEDURE DIVISION.
Begin.
    MOVE 1 TO AS-X
    PERFORM UNTIL AS-X=20
	
      DISPLAY AS-X
      ADD 1 TO AS-X
        
    END-PERFORM.
 

    STOP RUN.
