IDENTIFICATION DIVISION.
PROGRAM-ID.  REPETICAO.
AUTHOR.  VLADWOGUER BEZERRA.

DATA DIVISION.
WORKING-STORAGE SECTION.

01   AS-CONT       PIC 9(32).
01   AS-X       PIC 9(32).

PROCEDURE DIVISION.
Begin.
    PERFORM VARYING AS-CONT FROM 0 BY 1 UNTIL AS-CONT = 100
	
        DISPLAY AS-CONT
        MOVE AS-CONT TO AS-X
	IF AS-X = 50 THEN
           DISPLAY "MEIO"
        END-IF
        
    END-PERFORM.
 

    STOP RUN.
