       IDENTIFICATION DIVISION.
       PROGRAM-ID. VARIAVEIS.
      *> Exemplo COBOL Vladwoguer Bezerra Nov-2017
       DATA DIVISION.
            
              AS-ITEM-ELEM-1 PIC 9(002) VALUE 99.
       PROCEDURE DIVISION.
	   DISPLAY 'OLÁ MUNDO!'.
	   STOP RUN.
